using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ApexCardio
{
    public enum DeviceStatusId : byte
    {
        BP1_InProgress = 0,  // Идет измерение АД на левой руке
        BP1_OK = 1,  // Измерение АД на левой руке успешно завершено
        BP1_Error = 2,  // Ошибка измерения АД на левой руке
        BP1_Hold = 3,  // Удержание давления на левой руке (съем сфигмограммы)

        BP2_InProgress = 4,  // Идет измерение АД на левой ноге
        BP2_OK = 5,  // Измерение АД на левой ноге успешно завершено
        BP2_Error = 6,  // Ошибка измерения АД на левой ноге
        BP2_Hold = 7,  // Удержание давления на левой ноге (съем сфигмограммы)

        BP3_InProgress = 8,  // Идет измерение АД на правой руке
        BP3_OK = 9,  // Измерение АД на правой руке успешно завершено
        BP3_Error = 10, // Ошибка измерения АД на правой руке
        BP3_Hold = 11, // Удержание давления на правой руке (съем сфигмограммы)

        BP4_InProgress = 12, // Идет измерение АД на правой ноге
        BP4_OK = 13, // Измерение АД на правой ноге успешно завершено
        BP4_Error = 14, // Ошибка измерения АД на правой ноге
        BP4_Hold = 15, // Удержание давления на правой ноге (съем сфигмограммы)

        PPG_Error = 16  // Ошибка фотоплетизмограммы (нет пациента)
    }
}
